app/views/devise/registrations/new.html.erb

SELECT "roles"."name", "roles"."id" FROM "roles"
---
    <%= f.label :role %><br />
    <%= f.select :role_id, Role.pluck(:name, :id) %>